Repository: VisualCrypt/VisualCrypt
Catalog: Common/ApplicationLogic/VisualCrypt.Language/Strings/Resources.*.resx
Languages: de, it

source: Hello World!
de: Hallo Welt!
it: Ciao, mondo!

# constUntitledDotVisualCrypt
source: Untitled.visualcrypt
de: Unbenannt.visualcrypt
it: Senza titolo.visualcrypt

# encrpytedStatusbarText
source: VisualCrypt {0}, AES 256 Bit, 2^{1} Rounds , {2} Ch.
de: VisualCrypt {0}, AES 256 Bit, 2^{1}-fach, {2} Zeichen
it: VisualCrypt: {0}, AES 256 Bit, 2 ^ {1} arrotondamenti, capitolo {2}

# encProgr_ProcessingKey
source: Processing Key...
de: Schlüssel verarbeiten...
it: Elaborazione della chiave...

# encProgr_EncryptingRandomKey
source: Encrypting Random Key...
de: Zufallsschlüssel verschlüsseln...
it: Chiave di crittografia casuale...

# encProgr_EncryptingMessage
source: Encrypting Message...
de: Nachricht verschlüsseln...
it: La crittografia dei messaggi...

# encProgr_EncryptingMAC
source: Encrypting MAC...
de: Signatur verschlüsseln...
it: La crittografia di Mac...

# encProgr_DecryptingRandomKey
source: Decrypting Random Key...
de: Zufallsschlüssel entschlüsseln...
it: Decrittografare una chiave casuale...

# encProgr_DecryptingMessage
source: Decrypting Message...
de: Nachricht entschlüsseln...
it: La decrittografia del messaggio...

# encProgr_DecryptingMAC
source: Decrypting MAC...
de: Signatur entschlüsseln...
it: Decrittografia di Mac...

# encProgr_CalculatingMAC
source: Calculating MAC...
de: Signatur berechnen...
it: Il calcolo del Mac...

# uriSpecUrl
source: https://visualcrypt.com
de: https://visualcrypt.com/post/visualcrypt-2-encryption-standard-specification
it: https://visualcrypt.com/post/visualcrypt-2-encryption-standard-specification

# uriSourceUrl
source: https://visualcrypt.com
de: https://github.com/VisualCrypt/VisualCrypt
it: https://github.com/VisualCrypt/VisualCrypt

# uriPWSpecUrl
source: https://visualcrypt.com
de: https://visualcrypt.com/post/password-quality
it: https://visualcrypt.com/post/password-quality

# uriHelpUrl
source: https://visualcrypt.com
de: https://visualcrypt.com/category/faq
it: https://visualcrypt.com/category/faq

# termSetPassword
source: Set Password
de: Passwort setzen
it: Impostare la Password

# termSave
source: Save
de: Speichern
it: Salva

# termPassword
source: Password
de: Passwort

# termEncrypt
source: Encrypt
de: Verschlüsseln
it: Crittografare

# termDecrypt
source: Decrypt
de: Entschlüsseln
it: Decrittografare

# termCopyToClipboard
source: Copy to Clipboard
de: In die Zwischenablage kopieren
it: Copia negli Appunti

# termCancel
source: Cancel
de: Abbrechen
it: Annulla

# plaintextStatusbarText
source: Plaintext | {0} | {1}
de: Klartext | {0} | {1}
it: Testo normale | {0} | {1}

# plaintextStatusbarPositionInfo
source: Ln {0}, Col {1} | Pos {2}/{3}
de: Zeile {0}, Sp {1} | Pos {2}/{3}
it: Ln {0}, {1} Col | POS {2} / {3}

# operationEncryption
source: Encrypting:
de: Verschlüsseln:
it: Crittografia:

# operationEncryptAndSave
source: Encrypting and saving:
de: Verschlüsseln und speichern:
it: La crittografia e il salvataggio:

# operationDecryptOpenedFile
source: Decrypting loaded file:
de: Entschlüsseln der ladenden Datei:
it: Decrittografare il file aperto:

# operationDecryption
source: Decrypting:
de: Entschlüsseln:
it: La decrittografia:

# msgPasswordError
source: Incorrect password or corrupted/forged message.
de: Falsches Passwort oder beschädigte/verfälschte Daten.
it: Password errata o messaggio danneggiato contraffatti.

# miViewZoomOut
source: Zoom Out
de: Verkleinern
it: Zoom indietro

# miViewZoomLevelText
source: Zoom ({0}%)
de: Vergrößerung ({0}%)

# miViewZoomIn
source: Zoom In
de: Vergrößern
it: Eseguire lo zoom avanti

# miViewToolArea
source: Tool Area
de: Werkzeugbereich
it: Strumento Area

# miViewStatusBar
source: Status Bar
de: Statusleiste
it: Barra di stato

# miViewLanguage
source: Language
de: Sprache
it: Lingua

# miView
source: View
de: Ansicht
it: Visualizzazione

# miVCSettings
source: Settings...
de: Verschlüsselungseinstellungen...
it: Impostazioni di crittografia...

# miVCSetPassword
source: Set Password...
de: Passwort setzen...
it: Impostare la Password...

# miVCEncrypt
source: Encrypt
de: Verschlüsseln
it: Crittografare

# miVCDecrypt
source: Decrypt
de: Entschlüsseln
it: Decrittografare

# miVCChangePassword
source: Change Password...
de: Passwort ändern...
it: Cambia Password...

# miHelpViewOnline
source: View Help Online
de: Hilfe (Web)
it: Visualizzare la Guida in linea

# miHelpAbout
source: About VisualCrypt...
de: Über VisualCrypt...
it: Informazioni su VisualCrypt...

# miHelp
source: Help
de: Hilfe
it: Guida in linea

# miFormatWordWrap
source: Word Wrap
de: Zeilenumbruch
it: Ritorno a capo automatico

# miFormatFont
source: Font...
de: Schriftart...
it: Tipo di carattere...

# miFormatCheckSpelling
source: Spellchecking
de: Rechtschreibprüfung
it: Controllo ortografico

# miFileSaveAs
source: Save As...
de: Speichern als...
it: Salva come...

# miFileSave
source: Save
de: Speichern
it: Salva

# miFilePrint
source: Print...
de: Drucken...
it: Stampa...

# miFileOpen
source: Open...
de: Öffnen...
it: Apri...

# miFileNew
source: New
de: Neu
it: Nuovo

# miFileImportWithEnconding
source: Import With Encoding...
de: Import mit Codierungsauswahl...
it: Importazione con la codifica...

# miFileExportClearText
source: Export Cleartext...
de: Klartext exportieren...
it: Esporta in chiaro...

# miFileExit
source: Exit
de: Beenden
it: Uscita

# miFile
source: File
de: Datei

# miEditUndo
source: Undo
de: Rückgängig machen
it: Annulla

# miEditSelectAll
source: Select All
de: Alles auswählen
it: Seleziona tutto

# miEditReplace
source: Replace...
de: Ersetzen...
it: Sostituire...

# miEditRedo
source: Redo
de: Wiederholen
it: Ripeti

# miEditPaste
source: Paste
de: Einfügen
it: Incolla

# miEditInsertDateTime
source: Insert Date, Time
de: Datum, Uhrzeit
it: Inserisci data, ora

# miEditGoTo
source: Go To...
de: Gehe zu...
it: Vai a...

# miEditFindPrevious
source: Find Previous
de: Vorheriges suchen
it: Trova precedente

# miEditFindNext
source: Find Next
de: Weitersuchen
it: Trova successivo

# miEditFind
source: Find...
de: Suchen...
it: Trova...

# miEditDeleteLine
source: Delete Line
de: Zeile löschen
it: Elimina riga

# miEditCut
source: Cut
de: Ausschneiden
it: Taglio

# miEditCopy
source: Copy
de: Kopieren
it: Copia

# miEdit
source: Edit
de: Bearbeiten
it: Modifica

# msgDiscardChanges
source: Discard Changes?
de: Verwerfen?
it: Ignorare le modifiche?

# msgFindRegExNoMatch
source: No match for '{0}' could be found.
de: Keine Übereinstimmung für '{0}' gefunden.
it: Non Impossibile trovare alcuna corrispondenza per '{0}'.

# msgNothingFoundSearchFromStart
source: Nothing found - Search again from the top of the document?
de: Nichts gefunden - Suche vom Anfang des Dokuments neu starten?
it: Nessun risultato trovato - ricerca nuovamente dalla parte superiore del documento?

# msgReplaceOccucancesReplaced
source: {0} occurrences were replaced.
de: {0} Stellen wurden ersetzt.
it: sono state sostituite {0} occorrenze.

# msgReplaceInvalidRegEx
source: Invalid Regular Expression Syntax
de: Ungültiger regulärer Ausdruck-Syntax
it: Sintassi delle espressioni regolari non valido

# msgFindCouldNotBeFound
source: '{0}' could not be found.
de: '{0}' wurde nicht gefunden.
it: '{0}' non trovato.

# termChangePassword
source: Change Password
de: Passwort ändern
it: Cambia Password

# termReplaceAll
source: Replace All
de: Alle ersetzen
it: Sostituisci tutto

# titleImportWithEncoding
source: Import with encoding: {0}
de: Import mit Codierung: {0}
it: Importazione con codifica: {0}

# msgFileIsBinary
source: This file is neither text nor VisualCrypt - display with Hex View?\r\n\r\nIf file is very large the editor may become less responsive.
de: Diese Datei ist weder Text noch VisualCrypt - Hex-Ansicht anzeigen? \r\n\r\nWenn die Datei zu groß ist kann das Programm sehr langsam werden.
it: Questo file non è né testo né VisualCrypt - Visualizza con visualizzazione esadecimale? \r\n\r\nIf file è molto grande editor può diventare meno efficiente.

# spdm_Set_Title
source: Set Password
de: Passwort setzen
it: Impostare la Password

# spd_msgXofYUnicodeChars
source: {0} significant Unicode Characters
de: {0} signifikante Zeichen
it: {0} caratteri Unicode

# spd_msgUseEmptyPassword
source: Use empty password?
de: Leeres Passwort verwenden?
it: Utilizzare password vuota?

# spd_msgPasswordEffectivelyEmpty
source: The password is effectively empty - are you sure?
de: Das Passwort ist effektiv leer - verwenden?
it: La password è effettivamente vuota - è certi che?

# spdm_Set_OK
source: Set Password
de: Passwort setzen
it: Impostare la Password

# spdm_SetAndEncrypt_Title
source: Set Password & Encrypt
de: Passwort setzen & verschlüsseln
it: Crittografare Password set &

# spdm_SetAndEncrypt_OK
source: Encrypt
de: Verschlüsseln
it: Crittografare

# spdm_SetAndEncryptAndSave_Title
source: Set Password, Encrypt and Save
de: Passwort setzen, verschlüsseln & speichern
it: Impostare la Password, crittografare e salvare

# spdm_SetAndEncryptAndSave_OK
source: Encrypt and Save
de: Verschlüsseln und speichern
it: Crittografare e salvare

# spdm_SetAndDecrypt_Title
source: Set Password & Decrypt
de: Passwort setzen & entschlüsseln
it: Impostare Password &decrittografare

# spdm_SetAndDecrypt_OK
source: Decrypt
de: Entschlüsseln
it: Decrittografare

# spdm_SetAndDecryptLoadedFile_Title
source: Enter password to decrypt loaded file
de: Passwort zum Entschlüsseln der Datei
it: Immettere la password per decrittografare il file caricato

# spdm_SetAndDecryptLoadedFile_OK
source: Decrypt loaded file
de: Geladene Datei entschlüsseln
it: Decrittografare i file caricati

# spdm_CorrectPassword_Title
source: The current password is not correct
de: Das aktuelle Passwort ist nicht korrekt
it: La password corrente non è corretta

# spdm_CorrectPassword_OK
source: Change Password and decrypt
de: Ändern und Entschlüsseln
it: Cambiare la Password e la decrittografia

# spdm_Change_Title
source: Change Password
de: Passwort ändern
it: Cambia Password

# spdm_Change_OK
source: Change Password
de: Passwort ändern
it: Cambia Password

# termBinary
source: Binary File
de: Binärdatei
it: File binario

# titleExportCleartext
source: Export Clear Text (Encoding: {0})
de: Exportieren von Klartext (Codierung: {0})
it: Esportare testo non crittografato (codifica: {0})

# spd_linktext_PrintPassword
source: Print Password
de: Passwort drucken
it: Stampare la Password

# spd_linktext_GeneratePassword
source: Generate Password
de: Passwort vorschlagen
it: Generare Password

# spd_lbl_PasswordOrPhrase
source: Password/-phrase:
de: Passwort/Merksatz:
it: Password/frase:

# spd_text_ReadMoreAbout
source: Read more about
de: Weitere Informationen über
it: Per ulteriori informazioni su

# spd_text_from256BitRD
source: (256 Bit Random Data)
de: (256 Bit Zufallszahl)
it: da 256 Bit di dati casuali

# termClear
source: Clear
de: Löschen
it: Cancella

# spd_linktext_VisualCryptPasswords
source: VisualCrypt Passwords
de: VisualCrypt Passwörter
it: Password VisualCrypt

# termDefaults
source: Defaults
de: Standardeinstellungen
it: Impostazioni predefinite

# sett_warn_neutral
source: The setting influences the required computational work to create the BCrypt hash. A higher value means more work.
de: Die Einstellung wirkt sich auf die erforderliche rechnerische Arbeit aus, einen BCrypt-Hash zu erstellen. Ein hoher Wert bedeutet mehr Arbeit.
it: L'impostazione influenza il lavoro di calcolo necessario per creare l'hash BCrypt. Un valore maggiore indica una quantità di lavoro.

# sett_warn_low
source: Warning: A low value faciliates brute force and dictionary attacks.
de: Warnung: Ein niedriger Wert erleichtert Brute-Force- und Wörterbuchangriffe.
it: Avviso: Un valore basso faciliates brute force attacchi con dizionario.

# sett_warn_high
source: Warning: A high value will turn encryption and decryption into a very time consuming operation.
de: Warnung: Ein hoher Wert macht die Ver- und Entschlüsselung sehr langsam.
it: Avviso: Un valore elevato consente di ruotare la crittografia e decrittografia in un'operazione richiede molto tempo.

# sett_text_ReadThe
source: Read the
de: Lesen Sie die
it: Lettura di

# sett_text_orViewThe
source: or view the
de: oder die
it: o visualizzare il

# sett_text_default_2_power
source: Default: 2
de: Standard: 2
it: Predefinito: 2

# sett_text_EncrpytionMethod
source: Encryption Method
de: Verschlüsselung
it: Metodo di crittografia

# sett_text_BCryptAESRounds
source: BCrypt/AES Rounds:
de: BCrypt/AES-Runden:
it: BCrypt/AES arrotondamenti:

# sett_linktext_Spec
source: Spec
de: technische Spezifikation
it: Specifiche

# sett_linktext_Source
source: source code
de: Quellcode
it: codice sorgente

# fnt_label_typeFace
source: _Typeface:
de: Schnitt:

# fnt_labelSize
source: _Size:
de: Größe:

# fnt_labelPreview
source: Preview:
de: Vorschau:
it: Anteprima:

# fnt_labelFontFamilies
source: _Font family:
de: Schriftfamilie:
it: Famiglia _Font:

# fnt_theQuickBrownFox
source: The quick brown fox jumps over the lazy dog
de: Der schnelle braune Fuchs springt über den trägen Hund
it: Salta Cantami o Diva del pelide Achille

# termClearPassword
source: Clear Password
de: Passwort löschen
it: Cancella Password

# msgFormatError
source: Invalid VisualCrypt format - Cannot decrypt this.
de: Ungültiges VisualCrypt-Format - nicht entschlüsselbar.
it: Non valido formato 2 VisualCrypt: Impossibile decrittografare questo!

# msgInvalidFilename
source: Invalid Filename.
de: Ungültiger Dateiname.
it: Nome file non valido.

# miHelpLog
source: Log...
it: Registro...

# miFormat
source: Format
it: Formato

# sett_combo_VisualCrypt2
source: VisualCrypt 2 (AES 256 Bit, BCrypt - Multi)
it: VisualCrypt 2 (AES 256 Bit, BCrypt - multipla)
